---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalService.Dispose
source: html/111746bc-4ade-6ef5-bff8-63f14d564166.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.Dispose Method

Releases all resources used by the ExternalService

## Syntax (C#)
```csharp
public void Dispose()
```